In [43]:
import pandas
import pandas as pd
from pandas import *
import numpy as np

In [44]:
dic5 = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}    # 딕셔너리 형태를
data5 = pd.DataFrame(dic5)               # DataFrame 타입으로 변경
data5

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [45]:
data5.index = ['1','2','3','4','5']

In [46]:
data5

  city  year  temp
1   서울  2017    18
2   부산  2017    20
3   대전  2018    19
4   대구  2018    21
5   광주  2018    20

In [47]:
data5.loc['5']

city      광주
year    2018
temp      20
Name: 5, dtype: object

In [48]:
def f1(x):
    k = x.max()-x.min()
    return k

def f2(x):
    return x.max()-x.min()

In [49]:
#함수이름 = lambda 매개변수 : 소스코드
f3 = lambda x : x.max()-x.min()

In [50]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                  columns = ['A열','B열','C열'],
                  index = ['a','b','c','d'])
df

   A열  B열  C열
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11

In [51]:
df.apply(f2)

A열    9
B열    9
C열    9
dtype: int64

In [52]:
df.apply(f3,0) #열기준
df.apply(f3,1) #행기준

a    2
b    2
c    2
d    2
dtype: int64

In [53]:
frame = DataFrame(np.arange(8).reshape(2,4),
                 index=['three','one'],
                 columns = ['d','a','가','c'])
frame

       d  a  가  c
three  0  1  2  3
one    4  5  6  7

In [54]:
frame.sort_index()

       d  a  가  c
one    4  5  6  7
three  0  1  2  3

In [55]:
frame.sort_index(axis = 0) #행 기준

       d  a  가  c
one    4  5  6  7
three  0  1  2  3

In [56]:
frame.sort_index(axis = 1) #열 기준

       a  c  d  가
three  1  3  0  2
one    5  7  4  6

In [57]:
frame.sort_index(axis = 1,ascending = False) #내림차순

       가  d  c  a
three  2  0  3  1
one    6  4  7  5

In [58]:
frame

       d  a  가  c
three  0  1  2  3
one    4  5  6  7

In [59]:
frame.sort_index(axis = 1,ascending = False, inplace = True)

In [60]:
frame

       가  d  c  a
three  2  0  3  1
one    6  4  7  5

In [61]:
frame2=DataFrame({'b':[4,7,3,2],'a':[4,9,2,5],'c':[5,3,7,9]})
frame2

   b  a  c
0  4  4  5
1  7  9  3
2  3  2  7
3  2  5  9

In [62]:
frame2.sort_values(by='b')

   b  a  c
3  2  5  9
2  3  2  7
0  4  4  5
1  7  9  3

In [63]:
frame2.sort_values(by='a')
frame2.sort_values(by=['b','c'])

   b  a  c
3  2  5  9
2  3  2  7
0  4  4  5
1  7  9  3

In [64]:
obj =Series([100,23,55,44,22,99,33]); obj

0    100
1     23
2     55
3     44
4     22
5     99
6     33
dtype: int64

In [65]:
obj.rank()

0    7.0
1    2.0
2    5.0
3    4.0
4    1.0
5    6.0
6    3.0
dtype: float64

In [66]:
obj.rank(ascending=False)

0    1.0
1    6.0
2    3.0
3    4.0
4    7.0
5    2.0
6    5.0
dtype: float64

In [67]:
obj2=Series([100,23,55,44,22,44,33]);obj2

0    100
1     23
2     55
3     44
4     22
5     44
6     33
dtype: int64

In [68]:
obj2.rank()

0    7.0
1    2.0
2    6.0
3    4.5
4    1.0
5    4.5
6    3.0
dtype: float64

In [69]:
obj2.rank(ascending=False)

0    1.0
1    6.0
2    2.0
3    3.5
4    7.0
5    3.5
6    5.0
dtype: float64

In [70]:
obj3=Series([100,23,55,44,22,44,33,44]);obj3.rank()

0    8.0
1    2.0
2    7.0
3    5.0
4    1.0
5    5.0
6    3.0
7    5.0
dtype: float64

In [71]:
obj3.rank(method="min") #같은값의 등수 중 가장작은값으로 통일

0    8.0
1    2.0
2    7.0
3    4.0
4    1.0
5    4.0
6    3.0
7    4.0
dtype: float64

In [72]:
obj3.rank(method="max") #같은값의 등수중 가장큰값으로 통일

0    8.0
1    2.0
2    7.0
3    6.0
4    1.0
5    6.0
6    3.0
7    6.0
dtype: float64

In [73]:
obj3.rank(method="first") #같은값 순차적인 등수

0    8.0
1    2.0
2    7.0
3    4.0
4    1.0
5    5.0
6    3.0
7    6.0
dtype: float64

In [74]:
frame3 = pd.DataFrame({'b': [4, 4, 4, 2], 'a': [4, 9, 2, 5], 'c': [5, 3, 7, 9]});frame3

   b  a  c
0  4  4  5
1  4  9  3
2  4  2  7
3  2  5  9

In [75]:
frame3.rank()
frame3.rank(0)
frame3.rank(1)
frame3.sum()
frame3.sum(0)
frame3.mean()
frame3.mean(1)

0    4.333333
1    5.333333
2    4.333333
3    5.333333
dtype: float64

# 결측치
* 특정 타임에 측정이 되지 않았거나 잘못딘 값이 들어가누경우 절대로 0이아님

In [76]:
frame4 = pd.DataFrame({'b': [4, 4, 4, 2], 'a': [4, 9, 2, 5], 'c': [5, 3, 7, np.nan]}); frame4

   b  a    c
0  4  4  5.0
1  4  9  3.0
2  4  2  7.0
3  2  5  NaN

In [77]:
c1 = frame4.dropna(axis=0);c1

   b  a    c
0  4  4  5.0
1  4  9  3.0
2  4  2  7.0

In [78]:
c1 = frame4.dropna(axis=1);c1

   b  a
0  4  4
1  4  9
2  4  2
3  2  5

In [79]:
result = frame4.fillna(77);result

   b  a     c
0  4  4   5.0
1  4  9   3.0
2  4  2   7.0
3  2  5  77.0

In [80]:
frame4.idxmax(1)

0    c
1    a
2    c
3    a
dtype: object

In [81]:
frame4.idxmax(0)

b    0
a    1
c    2
dtype: int64

In [82]:
frame4.idxmin(0)

b    3
a    2
c    1
dtype: int64

In [83]:
frame5 = pd.DataFrame([[NA, 6.5, 3.],[NA, NA, NA],[NA, 6.5, 3.]])
frame5

      0     1     2
0  <NA>   6.5   3.0
1  <NA>  <NA>  <NA>
2  <NA>   6.5   3.0

In [84]:
result = frame5.fillna({0:5,2:9}) 
result

   0     1    2
0  5   6.5  3.0
1  5  <NA>  9.0
2  5   6.5  3.0

In [88]:
obj3 = Series(['c','a','d','a','a','c','b','b','c','c']); obj3;

In [87]:
obj3.to_csv('./file2.csv',header=True, index = False, encoding ='utf-8')
df2 = pd.read_csv('./file2.csv',sep = ',')
df2

   0
0  c
1  a
2  d
3  a
4  a
5  c
6  b
7  b
8  c
9  c

In [89]:
obj3.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [90]:
obj3.value_counts()

c    4
a    3
b    2
d    1
Name: count, dtype: int64

In [91]:
obj3.value_counts(sort=False)

c    4
a    3
d    1
b    2
Name: count, dtype: int64

In [92]:
obj3.isin(['b'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8    False
9    False
dtype: bool

In [94]:
obj3.isin(['b','c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [95]:
mask = obj3.isin(['b','c']); mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [97]:
obj3[mask]

0    c
5    c
6    b
7    b
8    c
9    c
dtype: object

In [98]:
frame6 = DataFrame({'x':['c','a','d','a','a','c','b','b','c','c'],
                   'y':['c','a','d','a','a','c','b','b','c','c'],
                   'z':['c','a','d','a','a','c','b','b','c','c']})

In [99]:
frame6

   x  y  z
0  c  c  c
1  a  a  a
2  d  d  d
3  a  a  a
4  a  a  a
5  c  c  c
6  b  b  b
7  b  b  b
8  c  c  c
9  c  c  c